Мониторинг/src/Documents/СопоставлениеТоваров/СопоставлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СопоставлениеТоваров</name>
  <registerRecords>InformationRegister.СостояниеМониторингаПозиций</registerRecords>
  <attributes>
    <name>ОтборХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сопоставление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Конкурент</name>
      <type>
        <types>CatalogRef.Конкуренты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаКонкурента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>CatalogRef.ШаблоныКомментариев</types>
      </type>
    </attributes>
    <attributes>
      <name>СопоставлениеКорректно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИменаКартинок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаМониторинга</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМониторинга</name>
      <type>
        <types>CatalogRef.ТипМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКНоменклатуре</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_РезультатОтбора</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаМониторинга</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конкурент</name>
      <type>
        <types>CatalogRef.Конкуренты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мониторинг/src/InformationRegisters/СостояниеМониторингаПозиций/СостояниеМониторингаПозиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеМониторингаПозиций</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>CatalogRef.ШаблоныКомментариев</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМониторинга</types>
    </type>
  </resources>
  <dimensions>
    <name>Конкурент</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаМониторинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мониторинг/src/Enums/СтатусыМониторинга/СтатусыМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМониторинга</name>
  <enumValues>
    <name>ПереоценкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаОдобрена</name>
  </enumValues>
  <enumValues>
    <name>СопоставлениеНекорректно</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаОтклонена</name>
  </enumValues>
  <enumValues>
    <name>СопоставлениеКорректно</name>
  </enumValues>
  <enumValues>
    <name>СопоставлениеОжидается</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаОжидается</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОжидается</name>
  </enumValues>
</mdclass:Enum>

Мониторинг/src/Documents/СопоставлениеТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//Ден  2017 11 30 ---новый регистр по статусам	
	движения.СостояниеМониторингаПозиций.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Сопоставление Из Сопоставление Цикл
		Движение = Движения.СостояниеМониторингаПозиций.Добавить();
		Движение.Номенклатура = ТекСтрокаТЧ_Сопоставление.Номенклатура;
		Движение.Конкурент = ТекСтрокаТЧ_Сопоставление.Конкурент;
		Движение.ДатаМониторинга = ТекСтрокаТЧ_Сопоставление.ДатаМониторинга;
		Если ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 0 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеНекорректно;
		ИначеЕсли ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 1 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеКорректно;
		ИначеЕсли ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 2 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеОжидается;
		КонецЕсли;
		Движение.Комментарий = ТекСтрокаТЧ_Сопоставление.Комментарий;
	КонецЦикла;
	//---
КонецПроцедуры
